console.log("Текст 1")
console.log("Helllo  world")
console.log("Hello  world my name is Eldos, and I'm 18 years old, And,I'm studiede at the KBTU university .")
console.log(5+7)



// два слеша это комментарий на джаве срипте 

/*

это многострочный коментарий ,слшеш звездочка -> звездочкак слеш Ю 


*/ 


// var и let это две переменные по которымы мы можем давать значние к любмым переменным на джаве скрипте оно  само определяет какая это переменнная стринг или же булеан или  же инт 


//  разница между префиксным и постфиксными значеними то что если писать var number = 5 ; number ++ то у нас сперва появиттьсся число 5 потом уже 6 а если будем пистаь ++ number то  у нас сразу появится 6 так как работае перфиксное занение 
//  кроме  этого и есть  конкатенация в язкакх програмиирвания конкатенация это когда две стрингы соединяются напрмиер если будем писать как числовао значение 5 +  стринг значение "eldos   то из за конктаенация у нас появится стрниг 5 eldos 5 + "eldos" -> str(obj)  with 5eldos result 


/**
 * Этф функция передает комментарий для какой лбио функции  
 * 
 */

function timeToMinute(time){

}